import streamlit as st
import pandas as pd
import numpy as np

df = pd.read_csv(r"C:\Users\kimjiyun\Downloads\훈련과정_전체데이터_ver3.csv")

# 8자리로 만들고
df['NCS_코드'] = df['NCS_코드'].astype(str).str.zfill(8)

# NCS 코드 4개로 나누어 직종 분류
df['NCS_1'] = df['NCS_코드'].str[0:2]
df['NCS_2'] = df['NCS_코드'].str[2:4]
df['NCS_3'] = df['NCS_코드'].str[4:6]
df['NCS_4'] = df['NCS_코드'].str[6:8]

ncs1_map = {
    '01': '사업관리',
    '02': '경영/회계/사무',
    '03': '금융/보험',
    '04': '교육/자연/사회과학',
    '05': '법률/경찰/소방/교도/국방',
    '06': '보건/의료',
    '07': '사회복지/종교',
    '08': '문화/예술/디자인/방송',
    '09': '운전/운송',
    '10': '영업판매',
    '11': '경비/청소',
    '12': '이용/숙박/여행/오락/스포츠',
    '13': '음식서비스',
    '14': '건설',
    '15': '기계',
    '16': '재료',
    '17': '화학/바이오',
    '18': '섬유/의복',
    '19': '전기/전자',
    '20': '정보통신',
    '21': '식품가공',
    '22': '인쇄/목재/가구/공예',
    '23': '환경/에너지/안전',
    '24': '농림어업'
}
df['NCS_1_분류명'] = df['NCS_1'].map(ncs1_map)

# 수강신청인원 0명인 행 제거
df = df[df['수강신청인원'] > 0].reset_index(drop=True)


# 인기있는 훈련과정(ncs)
df['신청률'] = df['수강신청인원'] / df['정원']

### 1차 직종에서 만족도점수 높은 순으로 정렬
import streamlit as st

# 딕셔너리 정의
ncs1_dict = {
    '01': '사업관리', '02': '경영/회계/사무', '03': '금융/보험', '04': '교육/자연/사회과학',
    '05': '법률/경찰/소방/교도/국방', '06': '보건/의료', '07': '사회복지/종교', '08': '문화/예술/디자인/방송',
    '09': '운전/운송', '10': '영업판매', '11': '경비/청소', '12': '이용/숙박/여행/오락/스포츠',
    '13': '음식서비스', '14': '건설', '15': '기계', '16': '재료', '17': '화학/바이오',
    '18': '섬유/의복', '19': '전기/전자', '20': '정보통신', '21': '식품가공',
    '22': '인쇄/목재/가구/공예', '23': '환경/에너지/안전', '24': '농림어업'
}

# 사용자에게 분류명 보여주고 선택
selected_name = st.selectbox("1차 직종을 선택하세요", list(ncs1_dict.values()))

# 선택한 이름에 해당하는 코드 가져오기
selected_code = [code for code, name in ncs1_dict.items() if name == selected_name][0]

# 필터링 및 상위 10개
filtered = df[df['NCS_1'] == selected_code].copy()
top10 = filtered.sort_values(by='만족도점수', ascending=False).head(10)

# 출력
st.write(f"### '{selected_name}' 분야의 만족도점수 Top 10")
# st.write(top10[['NCS_1', 'NCS_1_분류명', '제목', '만족도점수', '신청률', '수강신청인원', '정원', '주소']])
st.dataframe(
    top10[['제목', '만족도점수', '신청률', '수강신청인원', '정원', '주소']].reset_index(drop=True),
    use_container_width=True
)